schmmd/solectrac/esp32/src/main.cpp
// CAN bus health counters
uint32_t    g_frames_rx      = 0;   // total frames received
uint32_t    g_frames_decoded = 0;   // frames matching a known PGN/source
uint32_t    g_last_frame_ms  = 0;   // millis() at last received frame
bool        g_can_initialized = false;

// Session energy tracking (integrated power since boot)
uint32_t    g_session_last_ms   = 0;
uint32_t    g_session_active_ms = 0;   // sum of valid dt's — excludes bus-silent gaps
float       g_session_wh_drawn  = 0.0f;
float       g_session_wh_charged = 0.0f;

WebServer server(80);

// ── LED status indicator ──────────────────────────────────────────────────────
// Built-in WS2812 RGB LED on ESP32-S3-DevKitC-1 (RGB_BUILTIN, GPIO 48).
//   Red blink     — CAN driver failed to initialize
//   Amber blink   — Wi-Fi not connected
//   Dim white     — Alive, no CAN frames received recently
//   Green blink   — CAN frames arriving (toggles on bus activity)

#define LED_BLINK_MS  50    // half-period for blink states
#define LED_ACTIVE_MS 200   // frame age below which bus is "active"

static uint32_t g_led_last_toggle = 0;
static bool     g_led_on = false;

static inline void ledWrite(uint8_t r, uint8_t g, uint8_t b) {
#ifdef RGB_BUILTIN
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    rgbLedWrite(RGB_BUILTIN, r, g, b);
  #else
    neopixelWrite(RGB_BUILTIN, r, g, b);
  #endif
#endif
}

void updateLed() {
    uint32_t now = millis();
    bool toggle = (now - g_led_last_toggle) >= LED_BLINK_MS;

    if (!g_can_initialized) {
        if (toggle) { g_led_last_toggle = now; g_led_on = !g_led_on; }
        ledWrite(g_led_on ? 32 : 0, 0, 0);
        return;
    }
    if (WiFi.status() != WL_CONNECTED) {
        if (toggle) { g_led_last_toggle = now; g_led_on = !g_led_on; }
        ledWrite(g_led_on ? 24 : 0, g_led_on ? 12 : 0, 0);
        return;
    }
    bool active = (g_frames_rx > 0) && (now - g_last_frame_ms < LED_ACTIVE_MS);
    if (!active) {
        ledWrite(4, 4, 4);
        g_led_on = false;
        g_led_last_toggle = now;
        return;
    }
    if (toggle) {
        g_led_last_toggle = now;
        g_led_on = !g_led_on;
    }
    ledWrite(0, g_led_on ? 32 : 0, 0);
}

// ── Helpers ───────────────────────────────────────────────────────────────────

static inline uint16_t be16(uint8_t hi, uint8_t lo) {
    return ((uint16_t)hi << 8) | lo;
}

static inline uint16_t le16(uint8_t lo, uint8_t hi) {
    return ((uint16_t)hi << 8) | lo;
}

static bool allZero(const uint8_t* d) {
    for (int i = 0; i < 8; i++) if (d[i]) return false;
    return true;
}

// ── CAN decoder ───────────────────────────────────────────────────────────────

void decodeCAN(uint32_t can_id, const uint8_t* raw, uint8_t len) {
    g_frames_rx++;
    g_last_frame_ms = millis();

    uint8_t d[8] = {};
    memcpy(d, raw, len < 8 ? len : 8);

    uint8_t  src = can_id & 0xFF;
    uint8_t  pf  = (can_id >> 16) & 0xFF;
    uint8_t  ps  = (can_id >> 8)  & 0xFF;
    uint16_t pgn = ((uint16_t)pf << 8) | (pf >= 0xF0 ? ps : 0);

    // Count any frame from a known source as decoded, before the per-PGN
    // decoders below — they often early-return on all-zero idle frames.
    if (src == SRC_BMS || src == SRC_BMS_CHGR_IF || src == SRC_CHARGER ||
        src == SRC_VEHICLE || src == SRC_MOTOR || src == SRC_DASH)
        g_frames_decoded++;

    if (src == SRC_BMS) {

        if (pgn >= PGN_CELL_FIRST && pgn <= PGN_CELL_LAST) {
            if (allZero(d)) return;
            int base = (pgn - PGN_CELL_FIRST) * 4;
            for (int slot = 0; slot < 4; slot++) {
                int idx = base + slot;
                if (idx >= NUM_CELLS) break;
                uint16_t mv = be16(d[2*slot], d[2*slot+1]);
                if (mv && mv != 0xFFFF)
                    g_cell_v[idx] = mv / 1000.0f;
            }

        } else if (pgn >= PGN_TEMP_FIRST && pgn <= PGN_TEMP_LAST) {
            if (allZero(d)) return;
            int base = (pgn - PGN_TEMP_FIRST) * 8;
            for (int slot = 0; slot < 8; slot++) {
                int idx = base + slot;
                if (idx >= NUM_TEMPS) break;
                if (d[slot] && d[slot] != 0xFF)
                    g_temp_c[idx] = (float)(d[slot] - TEMP_OFFSET_C);
            }

        } else if (pgn == PGN_F100) {
            if (allZero(d)) return;
            uint16_t raw_cur = be16(d[2], d[3]);
            // Sign convention: positive = charging, negative = discharging.
            float amps  = -((int32_t)raw_cur - PACK_CURRENT_BIAS_RAW) * PACK_CURRENT_LSB_A;
            float volts = d[1] * PACK_VOLTAGE_LSB_V + PACK_VOLTAGE_OFFSET_V;
            g_pack.voltage_v   = volts;
            g_pack.current_raw = raw_cur;
            g_pack.current_a   = amps;
            g_pack.power_w     = volts * amps;
            g_pack.soc_raw     = d[4];
            g_pack.soc_pct     = d[4] * 0.4f - 0.8f;

            // Integrate power into session energy counters
            uint32_t now = millis();
            if (g_session_last_ms != 0) {
                uint32_t dt_ms = now - g_session_last_ms;
                float dt_s = dt_ms / 1000.0f;
                if (dt_s > 0 && dt_s < 5.0f) {   // sanity: skip bus-silent gaps
                    g_session_active_ms += dt_ms;
                    // power_w: positive = charging, negative = discharging
                    float wh = g_pack.power_w * dt_s / 3600.0f;
                    if (wh > 0) g_session_wh_charged += wh;
                    else        g_session_wh_drawn   += -wh;
                }
            }
            g_session_last_ms = now;

        } else if (pgn == PGN_F102) {
            if (allZero(d)) return;
            uint16_t max_mv = be16(d[0], d[1]);
            uint16_t min_mv = be16(d[2], d[3]);
            if (!max_mv || !min_mv) return;
            g_pack.cell_max_mv             = max_mv;
            g_pack.cell_min_mv             = min_mv;
            g_pack.cell_spread_mv          = max_mv - min_mv;
            g_pack.cell_max_n              = d[4];
            g_pack.cell_min_n              = d[5];
            g_pack.cell_spread_mv_reported = d[7];
            g_pack.v_estimate = 20.0f * (max_mv + min_mv) / 2.0f / 1000.0f;

