schmmd/solectrac/esp32/src/main.cpp
// ── HTTP handlers ─────────────────────────────────────────────────────────────

void handleJson() {
    server.send(200, "application/json", buildJson());
}

void handleRoot() {
    server.send(200, "text/html", R"HTML(<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Solectrac</title>
<style>
*{box-sizing:border-box;margin:0;padding:0}
body{background:#f0f2f5;color:#212121;font-family:system-ui,sans-serif;padding:10px;max-width:600px;margin:0 auto}
h3{font-size:.68em;text-transform:uppercase;letter-spacing:.1em;color:#757575;margin-bottom:8px}
.g2{display:grid;grid-template-columns:1fr 1fr;gap:8px;margin-bottom:8px}
.g4{display:grid;grid-template-columns:repeat(4,1fr);gap:8px;margin-bottom:8px}
@media(max-width:400px){.g4{grid-template-columns:1fr 1fr}}
.card{background:#fff;border-radius:10px;padding:12px;box-shadow:0 1px 2px rgba(0,0,0,.06)}
.big{font-size:1.9em;font-weight:700;line-height:1.1}
.unit{font-size:.5em;color:#9e9e9e;font-weight:400}
.sub{font-size:.72em;color:#757575;margin-top:2px}
.kv{display:flex;justify-content:space-between;align-items:center;font-size:.82em;padding:2px 0}
.kv .k{color:#757575}
.gauges{display:grid;grid-template-columns:1fr 1fr;gap:6px}
.gauge{display:block;width:100%}
.gauges h3{text-align:center}
.dir{display:grid;grid-template-columns:repeat(3,1fr);gap:6px;margin-bottom:8px}
.dirbtn{background:#fff;border-radius:10px;padding:16px 0;text-align:center;font-size:1.8em;font-weight:700;color:#bdbdbd;letter-spacing:.05em;box-shadow:0 1px 2px rgba(0,0,0,.06)}
.dirbtn.on{background:#c8e6c9;color:#1b5e20}
.pills{display:flex;flex-wrap:wrap;gap:5px;margin-bottom:8px}
.pill{padding:3px 10px;border-radius:20px;font-size:.72em;background:#eee;color:#9e9e9e}
.pill.on{background:#c8e6c9;color:#1b5e20}
.alert{background:#ffcdd2;color:#b71c1c;border-radius:8px;padding:10px 12px;margin-bottom:8px;font-size:.9em;font-weight:600}
#foot{text-align:center;font-size:.65em;color:#9e9e9e;margin-top:10px;padding-bottom:4px}
.ok{color:#2e7d32}.warn{color:#ef6c00}.bad{color:#c62828}
</style>
</head>
<body>
<div id="al"></div>
<div class="g4" id="kpi"></div>
<div class="card" style="margin-bottom:8px">
<div class="gauges">
<div>
<h3>Speed</h3>
<svg class="gauge" viewBox="0 0 200 120">
  <path d="M 20 100 A 80 80 0 0 1 180 100" fill="none" stroke="#e0e0e0" stroke-width="14" stroke-linecap="round"/>
  <path id="sprog" fill="none" stroke="#4caf50" stroke-width="14" stroke-linecap="round"/>
  <line id="sneed" x1="100" y1="100" x2="100" y2="30" stroke="#c62828" stroke-width="3" stroke-linecap="round"/>
  <circle cx="100" cy="100" r="5" fill="#c62828"/>
  <text x="20" y="116" text-anchor="middle" font-size="9" fill="#757575">0</text>
  <text x="180" y="116" text-anchor="middle" font-size="9" fill="#757575">11 mph</text>
  <text x="100" y="78" text-anchor="middle" font-size="26" font-weight="700" fill="#212121" id="sval">–</text>
  <text x="100" y="92" text-anchor="middle" font-size="9" fill="#9e9e9e" id="sunit">mph</text>
</svg>
</div>
<div>
<h3>Power</h3>
<svg class="gauge" viewBox="0 0 200 120">
  <path d="M 20 100 A 80 80 0 0 1 180 100" fill="none" stroke="#e0e0e0" stroke-width="14" stroke-linecap="round"/>
  <path id="pprog" fill="none" stroke="#4caf50" stroke-width="14" stroke-linecap="round"/>
  <line id="pneed" x1="100" y1="100" x2="100" y2="30" stroke="#c62828" stroke-width="3" stroke-linecap="round"/>
  <circle cx="100" cy="100" r="5" fill="#c62828"/>
  <text x="20" y="116" text-anchor="middle" font-size="9" fill="#757575">0</text>
  <text x="180" y="116" text-anchor="middle" font-size="9" fill="#757575">15 kW</text>
  <text x="100" y="78" text-anchor="middle" font-size="26" font-weight="700" fill="#212121" id="pval">–</text>
  <text x="100" y="92" text-anchor="middle" font-size="9" fill="#9e9e9e" id="punit">kW</text>
</svg>
</div>
</div>
</div>
<div class="dir" id="dir"></div>
<div class="card" style="margin-bottom:8px"><h3>Power Summary</h3><div id="psum"></div></div>
<div class="g2" id="mid"></div>
<div class="pills" id="flags"></div>
<div class="g2" id="bot"></div>
<div id="foot">Connecting…</div>
<script>
const f=(v,d=1)=>v==null?'–':v.toFixed(d);
const fi=v=>v==null?'–':(v>=0?'+':'')+v.toFixed(1);
function kv(k,v){return'<div class="kv"><span class="k">'+k+'</span><span>'+v+'</span></div>';}
var MC_FAULTS={
  12:'Controller Over Current',13:'Current Sensor Fault',
  15:'Controller Severe Undertemp',16:'Controller Severe Overtemp',
  17:'Severe B+ Undervoltage',18:'Severe B+ Overvoltage',
  22:'Controller Over Temp Cutback',23:'B+ Undervoltage Cutback',
  24:'B+ Overvoltage Cutback',25:'+5V Supply Failure',
  26:'Motor Temp Hot Cutback',29:'Motor Temp Sensor Fault',
  31:'Coil1 Driver Open/Short / Main Open/Short',
  32:'Coil2 Driver Open/Short / EM Brake Open/Short',
  36:'Encoder Fault / Sin/Cos Sensor Fault',37:'Motor Open',
  38:'Main Contactor Welded',39:'Main Contactor Did Not Close',
  41:'Throttle Wiper High',42:'Throttle Wiper Low',
  43:'Pot2 Wiper High',44:'Pot2 Wiper Low',
  45:'Pot Low Over Current',47:'HPD/Sequencing Fault',
  49:'Parameter Change Fault / PDO Timeout',
  71:'Stall Detected / Vehicle lock without applying hand brake',
  83:'Driver Supply',87:'Motor Characterization Fault',
  89:'Encoder Pulse Count Fault / Motor Type Fault',
  92:'EM Brake failed to set',99:'Parameter Mismatch'
};
var BMS_FAULTS={
  100:'SOC too high',101:'SOC too low',
  102:'Total voltage too high',103:'Total voltage too low',
  104:'Charge current fault',105:'Discharge current fault',
  106:'Battery temp too low',107:'Battery temp too high',
  108:'Battery under voltage',109:'Battery over voltage',
  110:'Battery temp unbalance',111:'Battery voltage unbalance',
  112:'Battery does not match',113:'Output pole temp too high',
  116:'Memory parameters fault',117:'Data memory fault',
  118:'Cell voltage detection fault',119:'Temperature detection fault',
  120:'Current detection fault',121:'Internal total voltage detection fault',
  122:'External total voltage detection fault',123:'Insulation monitoring fault',
  124:'Clock fault',125:'Internal CAN comm fault',
  126:'Serious insulation fault',127:'Slight insulation fault',
  140:'System fault level',142:'BMS fault — maintenance',
  143:'Battery fault — maintenance',144:'Battery system fault — maintenance',
  145:'Needs full charge/discharge cycle',146:'Maintenance mode status'
};
