schmmd/solectrac/esp32/src/main.cpp
function fwh(wh){
  if(wh==null)return'–';
  if(Math.abs(wh)>=1000)return(wh/1000).toFixed(2)+' kWh';
  return Math.round(wh)+' Wh';
}
function feta(s){
  if(s==null||s<=0)return'–';
  if(s>360000)return'>100h';
  var h=Math.floor(s/3600),m=Math.floor((s%3600)/60);
  return h>0?h+'h '+m+'m':m+'m';
}
function update(d){
  const p=d.pack||{},m=d.motor||{},can=d.can||{};
  const pc=p.cells||{},pt=pc.temp_summary||{};
  const bst=(d.bms&&d.bms.state)||{};
  const fts=d.faults||{},chg=d.charger||{},cmd=d.chgr_cmd||{};
  const s=d.session||{};
  const al=[];
  (fts.bms||[]).forEach(function(c){
    al.push('BMS '+c+(BMS_FAULTS[c]?' ('+BMS_FAULTS[c]+')':''));
  });
  (fts.mc||[]).forEach(function(c){
    al.push('MC '+c+(MC_FAULTS[c]?' ('+MC_FAULTS[c]+')':''));
  });
  document.getElementById('al').innerHTML=al.map(function(a){return'<div class="alert">⚠ '+a+'</div>';}).join('');
  const soc=p.soc_pct,scls=soc==null?'':soc<20?'bad':soc<40?'warn':'ok';
  const cur=p.current_a,pwr=p.power_w;
  const curLbl=cur==null?'':cur<-0.5?'discharge':cur>0.5?'charge':'idle';
  document.getElementById('kpi').innerHTML=
    '<div class="card"><h3>SoC</h3><div class="big '+scls+'">'+f(soc,0)+'<span class="unit">%</span></div><div class="sub">'+(s.wh_remaining!=null&&s.wh_capacity?(s.wh_remaining/1000).toFixed(2)+' / '+fwh(s.wh_capacity):'')+'</div></div>'+
    '<div class="card"><h3>Voltage</h3><div class="big">'+f(p.voltage_v,1)+'<span class="unit">V</span></div><div class="sub">60 – 84 V range</div></div>'+
    '<div class="card"><h3>Current</h3><div class="big">'+fi(cur)+'<span class="unit">A</span></div><div class="sub">'+curLbl+'</div></div>'+
    '<div class="card"><h3>Power</h3><div class="big">'+(pwr!=null?(pwr/1000).toFixed(1):'–')+'<span class="unit">kW</span></div><div class="sub">'+(pwr!=null?Math.round(Math.abs(pwr)/150)+'% of 15 kW max':'')+'</div></div>';
  const netCharging=s.wh_net!=null&&s.wh_net<0;
  const etaLabel=netCharging?'ETA to 100%':'ETA to 0%';
  const etaVal=netCharging?s.eta_to_full_s:s.eta_to_zero_s;
  document.getElementById('psum').innerHTML=
    kv('Session draw',fwh(s.wh_drawn))+
    kv('Session charge',fwh(s.wh_charged))+
    kv('Session net',(s.wh_net!=null&&s.wh_net>0?'+':'')+fwh(s.wh_net))+
    kv(etaLabel,feta(etaVal));
  // Gauges (speed + power)
  function setGauge(val,max,progId,needId){
    var cx=100,cy=100,r=80;
    var pr=document.getElementById(progId),nd=document.getElementById(needId);
    if(val==null){
      pr.setAttribute('d','');
      nd.setAttribute('x2',cx);nd.setAttribute('y2',cy-(r-12));
      return;
    }
    var frac=Math.max(0,Math.min(val/max,1));
    var th=Math.PI*(1-frac);
    var ex=cx+r*Math.cos(th),ey=cy-r*Math.sin(th);
    var nr=r-12,nx=cx+nr*Math.cos(th),ny=cy-nr*Math.sin(th);
    pr.setAttribute('d',val>0.05?'M '+(cx-r)+' '+cy+' A '+r+' '+r+' 0 0 1 '+ex.toFixed(2)+' '+ey.toFixed(2):'');
    nd.setAttribute('x2',nx.toFixed(2));nd.setAttribute('y2',ny.toFixed(2));
  }
  setGauge(m.speed_mph,11,'sprog','sneed');
  document.getElementById('sval').textContent=m.speed_mph!=null?m.speed_mph.toFixed(1):'–';
  document.getElementById('sunit').textContent=m.speed_mph!=null?'mph ('+(m.speed_kmh!=null?m.speed_kmh.toFixed(1):'–')+' km/h)':'mph';
  var pkw=pwr!=null?Math.abs(pwr)/1000:null;
  setGauge(pkw,15,'pprog','pneed');
  document.getElementById('pval').textContent=pkw!=null?pkw.toFixed(1):'–';
  document.getElementById('punit').textContent=pkw!=null?'kW ('+Math.round(pkw/15*100)+'%)':'kW';
  document.getElementById('dir').innerHTML=
    [['F',1],['N',0],['R',-1]].map(function(x){
      return'<div class="dirbtn '+(m.direction===x[1]?'on':'')+'">'+x[0]+'</div>';
    }).join('');
  document.getElementById('mid').innerHTML=
    '<div class="card"><h3>Cell</h3>'+
    kv('Max',(pc.max_mv!=null?(pc.max_mv/1000).toFixed(3):'–')+' V (#'+(pc.max_n||'?')+')')+
    kv('Min',(pc.min_mv!=null?(pc.min_mv/1000).toFixed(3):'–')+' V (#'+(pc.min_n||'?')+')')+
    kv('Spread',pc.spread_mv!=null?(pc.spread_mv+' mV'+(pc.max_mv&&pc.min_mv?' ('+(pc.spread_mv/((pc.max_mv+pc.min_mv)/2)*100).toFixed(2)+'%)':'')):'–')+
    kv('Temp max',pt.max_c!=null?pt.max_c+'°C':'–')+
    kv('Temp min',pt.min_c!=null?pt.min_c+'°C':'–')+
    '</div>'+
    '<div class="card"><h3>Motor</h3>'+
    kv('RPM',m.rpm_magnitude!=null?m.rpm_magnitude:'–')+
    kv('Range','R'+(m.range_gear||'?'))+
    kv('MC Temp',m.controller_temp_c!=null?m.controller_temp_c+'°C':'–')+
    kv('Motor Temp',m.motor_temp_c!=null?m.motor_temp_c+'°C':'–')+
    '</div>';
  var flagDefs=[
    ['Awake',bst.awake],['Drive Mode',bst.drive_mode],
    ['Operating',bst.operating],['Standby',bst.standby],
    ['Charging',bst.charging],['Charger Present',bst.charger_present],
    ['Output Enabled',bst.output_enable],['Main Contactor',bst.main_contactor]
  ];
  document.getElementById('flags').innerHTML=flagDefs.map(function(x){
    return'<div class="pill '+(x[1]?'on':'')+'">'+x[0]+'</div>';
  }).join('');
  var bot='';
  if(d.charger){
    var acSt=chg.line_ok?'<span class="ok">OK</span>':chg.no_line?'<span class="bad">No AC</span>':'–';
    bot+='<div class="card" style="grid-column:1/-1"><h3>Charger</h3>'+
      kv('Output V',f(chg.voltage_v))+kv('Output A',f(chg.current_a))+
      kv('AC line',acSt)+kv('Cmd V / A',f(cmd.voltage_v)+' / '+f(cmd.current_a))+'</div>';
  }
  document.getElementById('bot').innerHTML=bot;
  var age=can.last_frame_age_s;
  var dot=can.state==='running'?'<span class="ok">●</span>':'<span class="bad">●</span>';
  document.getElementById('foot').innerHTML=
    dot+' '+can.state+' · '+(can.frames_rx||0)+' rx · age '+(age!=null?age.toFixed(1)+'s':'–')+' · up '+f(d.uptime/3600,1)+'h';
}
function refresh(){
  fetch('/json').then(function(r){return r.json();}).then(update)
    .catch(function(){document.getElementById('foot').textContent='Error — retrying…';});
}
refresh();
setInterval(refresh,1000);
</script>
</body>
</html>)HTML");
}

// ── SLCAN ─────────────────────────────────────────────────────────────────────
// Presents the CAN bus as an SLCAN device over USB CDC serial.
// python-can: interface='slcan', channel='/dev/cu.usbmodem...'

static char   slcan_buf[32];
static uint8_t slcan_len = 0;
static bool   slcan_open = false;

void slcanSendFrame(const twai_message_t& msg) {
    if (!slcan_open) return;
    char line[32];
    int n = snprintf(line, sizeof(line), "T%08" PRIX32 "%u",
                     msg.identifier, msg.data_length_code);
    for (int i = 0; i < msg.data_length_code; i++)
        n += snprintf(line + n, sizeof(line) - n, "%02X", msg.data[i]);
    line[n++] = '\r';
    Serial.write((uint8_t*)line, n);
}

